# Задача 21: Программа принимает на вход координаты двух точек и 
# находит расстояние между ними в 3D прострастве.
import math
xa= 7
ya=-5
za=0
xb=1
yb=-1
zb=9
S= (xa-xb)**2+(ya-yb)**2+(za-zb)**2
S=math.sqrt(S)
print(f"S={S:.2f}")