#Задача 4: Программа принимает на вход три числа и выдаёт максимальное из этих чисел.
a=253
b=33
c=75
max=a
if max<b:
    max=b
    if max<c:
        max=c
print(max)
