#Задача 8: Программа принимает число N и показывает все четные числа от 1 до N

N=4
down=1
while down<=N:
    if down%2==0:
        print(down)
    down+=1 