#Задача 2. Программа принимает на вход два числа и показывает, какое из них больше, а какое меньше.

a=5
b=7
if a>b:
    print("max=", a)
else:
    print("max=", b)