# Задача 23: Программа принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
N=7
i=1
while i<=N:
    i3=i**3
    i+=1
    print(i3)