#Задача 29: Напишите программу, которая задаёт массив из некоторого количества 
# элементов и выводит их на экран с помощью функций. 
# (можно спрашивать количество вводимых элементов и вводить все значения с клавиатуры)

def fillMass(size):
    import random
    mass=[0]*size
    for i in range(size):
        mass[i]= random.randint(1,10)    
    print(mass)

fillMass(int(input("Введите размер массива: ")))