#Напишите программу, которая найдёт точку пересечения двух прямых, 
# заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

b1=int(input("Введите значение b1: "))
k1=int(input("Введите значение k1: "))
b2=int(input("Введите значение b2: "))
k2=int(input("Введите значение k2: "))

x=(b2-b1)/(k1-k2)
y1=k1*x+b1
y2=k2*x+b2
if y1==y2:
    print("x=",x,"y=", y1)
else:
    print("Ошибка")