#Задача 6: Программу на вход принимает число и показывает, является ли число чётным.
number=7
if number%2==0:
    print("Число четное")
else:
    print("Число не четное")