# Задача  4: Программа принимает на вход цифру, обозначающую день недели, 
# и проверяет, является ли этот день выходным
week=['понедельник','вторник','среда','четверг','пятница','суббота','воскресение']
day=int(input("Введи день недели "))
index=day-1
if index==5 or index==6:
    print("День недели", week[index], "- выходной")
else:
    print("День недели", week[index], "- не выходной")